---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures
source: html/d1210198-fad4-6166-bafe-cf155e2dfafd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures

Failures related to Assemblies.

## Syntax (C#)
```csharp
public static class AssemblyFailures
```